Repository: KDE/kmouth
Catalog: po/*/kmouth.po
Languages: ar, he

# NAME OF TRANSLATORS
source: Your names
ar: زايد السعيدي
he: Lev Polvoi,Sagiv Barhoom,צוות התרגום של KDE ישראל

# EMAIL OF TRANSLATORS
source: Your emails
ar: zayed.alsaidi@gmail.com
he: lev@israsrv.net.il,Sagiv.Barhoom@KDEmail.net,kde-l10n-he@kde.org

source: Initial Configuration - KMouth
ar: تهيئة أوليّة - ناطق
he: הגדרות ראשוניות - KMouth

source: Text-to-Speech Configuration
ar: ضبط نطق النّص
he: הגדרות טקסט לדיבור

source: Initial Phrase Book
ar: دفتر التَّعابير الأوليّ
he: ספרון מונחים ראשוני

source: Word Completion
ar: تكملة الكلمات
he: השלמת מילים

source: &Open as History...
ar: ا&فتح كتأريخ
he: &פתיחה כהיסטוריה…

source: Opens an existing file as history
ar: فتح ملف موجود كتأريخ
he: פתיחת קובץ קיים כהיסטוריה

source: Save &History As...
ar: ا&حفظ التّأريخ كـ...
he: שמירת ההיסטוריה &בשם…

source: Saves the actual history as...
ar: يحفظ التّأريخ الحاليّ كـ...
he: שמירת ההיסטוריה עצמה בשם…

source: &Print History...
ar: &طباعة التّأريخ...
he: ה&דפסת ההיסטוריה…

source: Prints out the actual history
ar: يطبع التّأريخ الحاليّ
he: הדפסת ההיסטוריה עצמה

source: Quits the application
ar: يغادر التَّطبيق
he: יציאה מהיישום

source: Cuts the selected section and puts it to the clipboard
ar: يقُصُ المقطع المحدد ويضعه في حافظة القُصاصات
he: גזירת החלק הנבחר והעברתו ללוח הגזירים

source: Cuts the selected section and puts it to the clipboard. If there is some text selected in the edit field it is placed it on the clipboard. Otherwise the selected sentences in the history (if any) are placed on the clipboard.
ar: يقُصُ المقطع المحدد ويضعه في حافظة القُصاصات. إن وُجد بعض النصوص المحددة في حقل التَّحرير، فإنَّه توضع في حافظة القُصاصات. فيما عدا ذلك، فإنّ الجُمَل المحددة في التَّأريخ (إن وُجدت) توضع في حافظة القُصاصات.
he: גזירת הקטע הנבחר והעברתו ללוח הגזירים. אם יש טקסט כלשהו שנבחר בשדה העריכה, הוא יועבר ללוח הגזירים. אחרת המשפטים הנבחרים מההיסטוריה (אם יש) יוצבו בלוח הגזירים.

source: Copies the selected section to the clipboard
ar: ينسخ المقطع المحدد إلى حافظة القُصاصات
he: העתקת הקטע הנבחר ללוח הגזירים

source: Copies the selected section to the clipboard. If there is some text selected in the edit field it is copied to the clipboard. Otherwise the selected sentences in the history (if any) are copied to the clipboard.
ar: ينسخ المقطع المحدد إلى حافظة القُصاصات. إن وُجد بعض النصوص المحددة في حقل التَّحرير، فإنَّه سينسخها في حافظة القُصاصات. فيما عدا ذلك، فإنّ الجُمَل المحددة في التَّأريخ (إن وُجدت) ستُنسخ في حافظة القُصاصات.
he: העתקת החלק הנבחר אל לוח העריכה. אם יש טקסט כלשהו שנבחר בשדה העריכה, הוא יועתק אל לוח העריכה. אחרת יועתקו אל לוח העריכה המשפטים שנבחרו בהיסטוריה (אם ישנם כאלה).

source: Pastes the clipboard contents to current position
ar: لصق محتويات الحافظة في الموضع الحالي
he: הדבקת תוכן לוח הגזירים במקום הנוכחי

source: Pastes the clipboard contents at the current cursor position into the edit field.
ar: يُلصِق محتويات حافظة القُصاصات عند الموضع الحاليّ للمؤشر داخل حقل التَّحرير.
he: הדבקת תוכן לוח העריכה לתוך שדה העריכה, במיקום הנוכחי של הסמן.

# Start speaking
source: &Speak
ar: &نُطق
he: הק&ראה

source: Speaks the currently active sentence(s)
ar: ينطق الجملة/الجمل النّشطة حالياً
he: הקראת המשפטים הנוכחיים

source: Speaks the currently active sentence(s). If there is some text in the edit field it is spoken. Otherwise the selected sentences in the history (if any) are spoken.
ar: ينطق الجملة/الجمل النّشطة حالياً. إن كان هناك بعض النصوص في حقل التَّحرير، فإنّه ستُنْطَق. فيما عدا ذلك، فإنّ الجمل المحددة بالتَّأريخ (إن وُجِدَت) ستُنطق.
he: הקראת המשפטים שנבחרו. אם יש טקסט כלשהו בלוח הגזירים, הוא יוקרא. אחרת, המשפטים שנבחרו בהיסטוריה (אם יש) יוקראו.

source: &Edit...
ar: &تحرير...
he: &עריכה…

source: Show P&hrasebook Bar
ar: أظهر شريط &دفتر التعابير
he: הצגת שורת &ספרוני מונחים

source: Enables/disables the phrasebook bar
ar: يُفعّل/يُعطّل شريط دفتر التعابير
he: הפעלת/השבתת סרגל ספרון המונחים

source: Enables/disables the statusbar
ar: يُفَعِّل/يُعَطِّل شريط الحالة
he: הפעלת/השבתת שורת המצב

source: &Configure KMouth...
ar: &ضبط ناطق...
he: ה&גדרות KMouth…

source: Opens the configuration dialog
ar: يفتح حوار التَّهيئة
he: פתיחת חלונית הגדרות

source: &Speak
ar: ا&نطق
he: הק&ראה

source: Speaks the currently selected phrases in the history
ar: ينطق التَّعابير المحددة حالياً بالتَّأريخ
he: הקראת המשפטים שנבחרו מההיסטוריה

source: &Delete
ar: ا&حذف
he: מ&חיקה

source: Deletes the currently selected phrases from the history
ar: احذف التَّعابير المحددة حالياً من التَّأريخ
he: הסרת המשפטים הנבחרים מההיסטוריה

source: Cu&t
ar: ق&ص
he: &גזירה

source: Cuts the currently selected phrases from the history and puts them to the clipboard
ar: يقُص التَّعابير المحددة حاليا من التَّأريخ ويضعها في حافظة القُصاصات
he: גזירת המשפטים הנבחרים מההיסטוריה והעברתם ללוח הגזירים

source: &Copy
ar: ا&نسخ
he: ה&עתקה

source: Copies the currently selected phrases from the history to the clipboard
ar: ينسخ التَّعابير المحددة حالياً من التَّأريخ باتجاه حافظة القُصاصات
he: העתקת המשפטים הנבחרים מההיסטוריה ללוח הגזירים

source: Select &All Entries
ar: حدد &كل المُدْخَلات
he: בחירת &כל הרשומות

source: Selects all phrases in the history
ar: يحدد كافة التَّعابير في التَّأريخ
he: בחירת כל המשפטים שבהיסטוריה

source: D&eselect All Entries
ar: ا&لغِ تحديد كافة المُدْخَلات
he: &לא לבחור באף רשומה

source: Deselects all phrases in the history
ar: يُزيلُ تحديد كافة التَّعابير في التَّأريخ
he: ביטול בחירת המשפטים שבהיסטוריה

# The job is done
source: Ready.
ar: جاهز.
he: מוכן.

source: Opening file...
ar: جاري فتح الملف...
he: קובץ נפתח…

source: Saving history with a new filename...
ar: جاري حفظ التَّأريخ باسم ملف جديد...
he: ההיסטוריה נשמרת בשם קובץ חדש…

source: Printing...
ar: يطبع...
he: מודפס…

# Shutting down the application
source: Exiting...
ar: يخرج…
he: נסגר…

source: Toggling menubar...
ar: يُبدِّل شريط القوائم...
he: סרגל התפריטים מוצג/מוסתר…

source: Toggling toolbar...
ar: جاري تبديل شريط الأدوات...
he: סרגל הכלים מוצג/מוסתר…

source: Toggling phrasebook bar...
ar: يُبدِّل شريط دفتر التعابير...
he: סרגל ספרוני מונחים מוצג/מוסתר…

source: Toggle the statusbar...
ar: تبديل شريط الحالة...
he: שורת המצב מוצגת/מוסתרת…

source: &File
ar: &ملف
he: &קובץ

source: &Edit
ar: &حرّر
he: &עריכה

source: &Phrase Books
ar: &دفاتر تعابير
he: &ספרון מונחים

source: &Settings
ar: إ&عدادات
he: ה&גדרות

source: KMouth
ar: ناطق

source: A type-and-say front end for speech synthesizers
ar: الوُجهة الخلفيّة آكتب-و-قل لموالفات النُّطق
he: ממשק „הקלד והקראה” ליצירת דיבור

source: (c) 2002/2003, Gunnar Schmi Dt
ar: (ج) 2002/2003، غونار شمي دت
he: (c) 2002/2003, גונאר שמידט

source: Gunnar Schmi Dt
ar: غونار شمي دت
he: גונאר שמידט

source: Original Author
ar: المؤلف الأصلي
he: יוצר מקורי

source: Jeremy Whiting
ar: جيريمي وايتينغ
he: ג׳רמי וייטינג

source: Current Maintainer
ar: الصائن الحاليّ
he: מתחזק נוכחי

source: Olaf Schmidt
ar: أولاف شميت
he: אולף שמידט

source: Tips, extended phrase books
ar: تلميحات، دفاتر تعابير مُوَسَّعة
he: עצות, ספרוני מונחים מורחבים

source: History file to open
ar: ملف التَّأريخ الواجب فتحه
he: קובץ היסטוריה לפתיחה

source: Configuration
ar: الضبط
he: הגדרות

source: &Preferences
ar: &تفضيلات
he: העד&פות

source: &Text-to-Speech
ar: &نطق النّص
he: ה&קראת טקסט

source: General Options
ar: خيارات عامة
he: אפשרויות כלליות

source: Please decide which phrase books you need:
ar: فضلاً قرِّر أي دفاتر تعابير تحتاجها:
he: נא להחליט אילו ספרוני מונחים נחוצים לך:

source: Book
ar: الكتاب
he: ספר

source: Phrase Books (*.phrasebook);;Plain Text Files (*.txt);;All Files (*)
ar: دفاتر تعابير (*.phrasebook);;ملفات نص عادي (*.txt);;كل الملفات (*)
he: קובצי ספרוני מונחים (‎*.phrasebook);;קובצי טקסט פשוט (‎*.txt);;כל הקבצים (*)

source: Plain Text Files (*.txt);;Phrase Books (*.phrasebook);;All Files (*)
ar: ملفات نص عادي (*.txt);;دفاتر تعابير (*.phrasebook);;كل الملفات (*)
he: קובצי טקסט פשוט (‎*.txt);;ספרוני מונחים (‎*.phrasebook);;כל הקבצים (*)

source: The file %1 already exists. Do you want to overwrite it?
ar: الملفّ %1 موجود فعلًا. أتريد الكتابة فوقه؟
he: הקובץ %1 כבר קיים. לשכתב אותו?

source: File Exists
ar: الملف موجود
he: קובץ קיים

source: &Overwrite
ar: ا&ستبدل
he: &שכתוב

source: Your chosen filename <i>%1</i> has a different extension than <i>.phrasebook</i>. Do you wish to add <i>.phrasebook</i> to the filename?
ar: الملف الذي اخترته <i>%1</i> له امتداد يختلف عن <i>.phrasebook</i>. هل ترغب بإضافة <i>.phrasebook</i> إلى اسم الملف؟
he: לשם הקובץ שבחרת <i>%1</i> יש סיומת שאינה <i>.phrasebook</i>. להוסיף <i>.phrasebook</i> לשם הקובץ?

source: File Extension
ar: امتداد الملفّ
he: סיומת שם קובץ

source: Add
ar: أضف
he: הוספה

source: Do Not Add
ar: لا تُضف
he: לא להוסיף

source: Your chosen filename <i>%1</i> has the extension <i>.phrasebook</i>. Do you wish to save in phrasebook format?
ar: الملف الذي اخترته <i>%1</i> له امتداد <i>.phrasebook</i>. هل ترغب بالحفظ بصيغة دفتر التعابير؟
he: לשם הקובץ שבחרת <i>%1</i> יש סיומת <i>.phrasebook</i>. לשמור אותו בתסדיר ספרון מונחים?

source: As Phrasebook
ar: بصيغة دفتر تعابير
he: כספרון מונחים

source: As Plain Text
ar: كنص عادي
he: כטקסט פשוט

source: Phrase
ar: عبارة
he: ביטוי

source: Shortcut
ar: الاختصار
he: קיצור־דרך

source: Phrase Book
ar: دفتر تعابير
he: ספרון מונחים

source: &New Phrase
ar: عبارة &جديدة
he: &משפט חדש

source: Adds a new phrase
ar: أضف عبارة جديدة
he: מוסיף משפט חדש

source: New Phrase &Book
ar: دفتر تعابير &جديد
he: ספרון מונחים &חדש

source: Adds a new phrase book into which other books and phrases can be placed
ar: يضيف دفتر تعابير جديد يمكن وضع دفاتر تعابير وعبارات أخرى فيه
he: מוסיף ספר מונחים חדש שאפשר לשים בו ספרים אחרים ומשפטים

source: Saves the phrase book onto the hard disk
ar: احفظ دفتر التعابير في القرص الصلب
he: שמירת ספרון המונחים בכונן הקשיח

source: &Import...
ar: ا&ستورد...
he: יי&בוא…

source: Imports a file and adds its contents to the phrase book
ar: يستورد ملفاً ويضيف محتوياته إلى دفتر التعابير
he: ייבוא קובץ והוספת תוכנו לספרון המונחים

source: I&mport Standard Phrase Book
ar: ا&ستورد دفتر تعابير قياسي
he: ייבוא ספרון מונחים &תקני

source: Imports a standard phrase book and adds its contents to the phrase book
ar: يستورد دفتر تعابير قياسي ويضيف محتوياته إلى دفتر التعابير
he: ייבוא ספרון מונחים תקני והוספת תוכנו לספרון המונחים

source: &Export...
ar: &صدّر...
he: יי&צוא…

source: Exports the currently selected phrase(s) or phrase book(s) into a file
ar: يصدّر العبارة (العبارات) أو دفتر التعابير (دفاتر التعابير) المحددة حالياً إلى ملف
he: ייצוא המשפטים או ספרוני המונחים הנבחרים לקובץ

source: Closes the window
ar: اغلق النافذة
he: סגירת החלון

source: Cuts the currently selected entries from the phrase book and puts it to the clipboard
ar: اقطع المُدْخَلات المحددة حالياً من دفتر التعابير وضعها في حافظة القصاصات
he: גזירת הרשומות הנבחרות מהשיחון והעברתן אל לוח הגזירים

source: Copies the currently selected entry from the phrase book to the clipboard
ar: انسخ المُدْخَل المحدد حالياً من دفتر التعابير إلى حافظة القصاصات
he: העתקת הרשומה הנבחרת מספרון המונחים ללוח הגזירים

source: Deletes the selected entries from the phrase book
ar: احذف المُدْخَلات المحددة من دفتر التعابير
he: מחיקת הרשומות הנבחרות מספרון המונחים

source: Text of the &phrase:
ar: نص &التَّعبير:
he: &טקסט המשפט:

source: Name of the &phrase book:
ar: اسم &دفتر التعابير:
he: &שם ספרון המונחים:

source: <qt>There are unsaved changes.<br />Do you want to apply the changes before closing the "phrase book" window or discard the changes?</qt>
ar: <qt>توجد تغييرات لم تُحفظ.<br />هل ترغب بتطبيق التغييرات قبل إغلاق نافذة "دفتر التعابير" أم تجاهل التغييرات؟</qt>
he: <qt>יש שינויים שלא נשמרו.<br>להחיל שינויים אלו לפני סגירת חלון „ספרון המונחים” או להיפטר מהם?</qt>

source: Closing "Phrase Book" Window
ar: يغلق نافذة "دفتر التعابير"
he: סגירת חלון „ספרון המונחים”

source: (New Phrase Book)
ar: (دفتر التعبير جديد)
he: (ספרון מונחים חדש)

source: (New Phrase)
ar: (عبارة جديدة)
he: (משפט חדש)

source: Import Phrasebook
ar: استورد دفتر تعابير
he: ייבוא ספרון מונחים

source: Phrase Books (*.phrasebook);Plain Text Files (*.txt);All Files (*)
ar: دفاتر تعابير (*.phrasebook);ملفات نص عادي (*.txt);كل الملفات (*)
he: ספרוני מונחים (‎*.phrasebook);קובצי טקסט פשוט (‎*.txt);כל הקבצים (*)

source: There was an error loading file %1
ar: طرأ خطأ عند تعبئة ملف %1
he: אירעה שגיאה בטעינת הקובץ %1

source: Export Phrase Book
ar: صدّر دفاتر تعابير
he: ייצוא ספרון מונחים

source: Phrase Books (*.phrasebook)
ar: دفاتر تعابير (*.phrasebook)
he: ספרוני מונחים (‎*.phrasebook)

source: There was an error saving file %1
ar: طرأ خطأ عند حفظ ملف %1
he: אירעה שגיאה בשמירת הקובץ %1

source: &Currently Selected Phrase or Phrase Book
ar: التَّعبير أو دفتر التَّعابير ال&محدد حاليا
he: ה&דפסת המשפטים או ספרוני המונחים הנבחרים

source: By clicking on this button you can select the keyboard shortcut associated with the selected phrase.
ar: بالنقر على هذا الزر يمكنك اختيار اختصار لوحة المفاتيح المرتبط بالعبارة المحددة.
he: לחיצה על כפתור זה מאפשרת להגדיר אילו מקשי קיצור משויכים למשפט הנבחר.

source: With this line edit you define the name of a sub-phrasebook or the contents of a phrase.
ar: باستخدام حقل التحرير هذا، يمكنك تحديد اسم دفتر تعابير فرعي أو محتويات عبارة.
he: באמצעות עריכת שורה זו אפשר להגדיר את שם תת־ספרון המונחים או את תוכן המשפט.

source: If you select this option then the selected phrase will not be reachable by a keyboard shortcut.
ar: إذا اخترت هذا الخيار، لن تكون العبارة المحددة قابلة للوصول بواسطة اختصار لوحة المفاتيح.
he: אם בחרת באפשרות זו אז המשפט הנבחר לא יהיה נגיש דרך מקשי קיצור במקלדת.

source: &None
ar: لا &شيء
he: ל&לא

source: If you select this option then the selected phrase will be reachable by a keyboard shortcut. You can change the shortcut with the button next to this option.
ar: إذا اخترت هذا الخيار، ستكون العبارة المحددة قابلة للوصول بواسطة اختصار لوحة المفاتيح. يمكنك تغيير الاختصار باستخدام الزر الموجود بجانب هذا الخيار.
he: בחירה באפשרות זו תוביל לכך שהמשפט הנבחר יהיה נגיש דרך מקשי קיצור. אפשר להחליף את מקשי הקיצור עם הכפתור שליד האפשרות הזאת.

source: C&ustom
ar: مُ&خصَّص
he: ה&תאמה אישית

source: Shortcut for the phrase:
ar: إختصار التَّعبير:
he: מקש קיצור למשפט:

source: This list contains the current phrase book in a tree structure. You can select and modify individual phrases and sub phrase books
ar: تحتوي هذه اللائحة على دفتر التعابير الحالي في بنية شجرية. يمكنك اختيار وتعديل العبارات الفردية ودفاتر التعابير الفرعية
he: רשימה זו מכילה את ספרון המונחים הנוכחי במבנה עץ. אפשר לבחור ולערוך מונחים בנפרד ותת־ספרוני מונחים

source: This list contains the history of spoken sentences. You can select sentences and press the speak button for re-speaking.
ar: تحتوي هذه اللائحة على تأريخ الجمل المنطوقة. بإمكانك تحديد جُمل والضَّغط على زر النُّطق بغرض إعادة نُطقِها.
he: רשימה זו מכילה את היסטוריית המשפטים שהוקראו. אפשר לבחור משפט וללחוץ על הכפתור „הקראה” כדי להקריא אותו שוב.

source: Into this edit field you can type a phrase. Click on the speak button in order to speak the entered phrase.
ar: يمكنك رقن تعبير داخل حقل التَّحرير هذا. آنقر على زُر النُّطق بغرض نُطق التَّعبير المُدْخَل.
he: בשדה עריכה זה אפשר להקליד משפט. אפשר ללחוץ על הכפתור „הקראה” כדי להקריא את המשפט שהוקלד.

source: Save As
ar: احفظ كَ‍
he: שמירה בשם

source: Open File as History
ar: افتح الملف على أنَّه تأريخ
he: פתיחת קובץ כהיסטוריה

source: All Files (*);;Phrase Books (*.phrasebook);;Plain Text Files (*.txt)
ar: كل الملفات (*);;دفاتر تعابير (*.phrasebook);;ملفات نص عادي (*.txt)
he: כל הקבצים (*);;ספרוני מונחים (‎*.phrasebook);;קובצי טקסט פשוטים (‎*.txt)

source: Preferences
ar: تفضيلات
he: העדפות

source: This combo box specifies whether selected phrases of the phrase book are immediately spoken or just inserted into the edit field.
ar: مربع التَّراكيب هذا يُحدِّد إذا ما ستُنطق التَّعابير المحددة من دفتر التَّعابير في الحال أو تُدرج ضمن حقل التَّحرير.
he: תיבת בחירה משולבת זו מציינת האם המשפטים הנבחרים מספרון המונחים יוקראו מיידית או פשוט יתווספו לשדה העריכה.

source: &Selection of phrases in the phrase book:
ar: &تحديد تعابير في دفتر التَّعابير:
he: בעת ב&חירת משפטים בספרון המונחים:

source: Speak Immediately
ar: انطق فوراٌ
he: להקריא מיידית

source: Insert Into Edit Field
ar: الإدراج ضمن حقل التَّحرير
he: הוספה לשדה העריכה

source: This combo box specifies whether the phrase book is automatically saved when the edit window is closed.
ar: مربع التَّراكيب هذا يُحدِّد إذا ما سيحفظ دفتر التَّعابير آليّا عند إغلاق نافذة التَّحرير.
he: תיבת בחירה משולבת זו מציינת האם ספרון המונחים יישמר אוטומטית עם סגירת חלון העריכה.

source: Closing the phrase &book edit window:
ar: إغلاق نافذة تحرير &دفتر التَّعابير:
he: בעת &סגירת חלון עריכת ספרון המונחים:

source: Save Phrase Book
ar: احفظ دفتر التَّعابير
he: שמירת ספרון המונחים

source: Discard Changes
ar: ارفض التّغييرات
he: התעלמות מהשינויים

source: Ask Whether to Save
ar: السّؤال إن توجب الحفظ
he: לשאול האם לשמור

source: Text-to-Speech
ar: نطق النّص
he: הקראת טקסט

source: &Use default speech system
ar: استخدم &نظام النطق المبدئي
he: לה&שתמש במערכת הדיבור כברירת המחדל

source: &Engine:
ar: ال&محرك:
he: מ&נוע:

source: &Voice:
ar: ال&صّوت:
he: &קול:

source: Alternative
ar: البديل
he: חלופה

source: This field specifies both the command used for speaking texts and its parameters. KMouth knows the following placeholders: %t -- the text that should be spoken %f -- the name of a file containing the text %l -- the language code %% -- a percent sign
ar: هذا الحقل يحدد كلاً من الأمر المستخدم لنطق النصوص ومعاملاته. ناطق يعرف العلامات التالية: %t -- النص الذي يجب نطقه %f -- اسم ملف يحتوي على النص %l -- رمز اللغة %% -- علامة النسبة المئوية
he: שדה זה מציין הן את הפקודה המשמשת להקראת טקסטים והן את המשתנים של פקודה זו. KMouth מכירה את ממלאי המקום הבאים: %t -- הטקסט להשמעה %d -- שם הקובץ המכיל את הטקסט %l -- קוד השפה %% -- סימן אחוז

source: Command for speaking &texts:
ar: الأ&مر لنطق النصوص:
he: &פקודה להקראת טקסטים:

source: This check box specifies whether the text is sent as standard input to the speech synthesizer.
ar: مربع التَّراكيب هذا يُحدِّد إذا ما سيرسل النَّص على أنَّه مُدْخَل معياريّ إلى مؤلف النُّطق.
he: תיבת סימון זו קובעת אם הטקסט יישלח למגבש הדיבור בתור קלט תקני (stdin).

source: Send the data as standard &input
ar: أرسل البيانات على أنّها &مُدْخَل معياريّ
he: ל&שלוח נתונים בתור קלט תקני (stdin)

source: This combo box specifies which character encoding is used for passing the text.
ar: مربع التَّراكيب هذا يُحدِّد أي ترميز للحروف سيُستخدم بغرض تمرير النَّص.
he: תיבה משולבת זו קובעת איזה קידוד תווים ישמש להעברת הטקסט.

source: Character encodin&g:
ar: ترميز ال&حروف:
he: קידוד &תווים:

source: If you select this check box the words are spell-checked before they are inserted into the new dictionary.
ar: إذا اخترت هذا المربع، تُفحص الكلمات إملائياً قبل إدراجها في القاموس الجديد.
he: על ידי סימון אפשרות זו, המילים ייבדקו על ידי בודק איות לפני ההכנסה למילון החדש.

source: C&ompare to OpenOffice.org dictionary:
ar: قا&رن بقاموس OpenOffice.org:
he: ה&שוואה למילון של OpenOffice.org:

source: With this combo box you select the character encoding used to load text files. This combo box is not used for XML files or for dictionary files.
ar: باستخدام مربع التركيب هذا، اختر ترميز الأحرف المستخدم لتحميل الملفات النصية. لا يُستخدم هذا المربع لملفات XML أو لملفات القاموس.
he: עם תיבה משולבת זו, אפשר לבחור את הקידוד לטעינה של קבצים. תיבה משולבת זו לא משפיעה על קובצי XML או מילונים.

source: Character &encoding:
ar: &ترميز الحروف:
he: הגדרת &קידוד:

source: With this input field you specify which file you want to load for creating the new dictionary.
ar: باستخدام حقل الإدخال هذا، حدد الملف الذي ترغب بتحميله لإنشاء القاموس الجديد.
he: בשדה קלט זה, אפשר להגדיר איזה קובץ לטעון כדי ליצור את המילון החדש.

source: &Filename:
ar: &إسم الملف:
he: שם &קובץ:

source: With this input field you select the OpenOffice.org directory that will be used to spellcheck the words of the new dictionary.
ar: باستخدام حقل الإدخال هذا، اختر دليل OpenOffice.org الذي سيُستخدم لفحص الكلمات إملائياً في القاموس الجديد.
he: בשדה קלט זה אפשר לבחור את תיקיית OpenOffice.org שתשמש לבדיקת איות המילים של המילון החדש.

source: With this combo box you decide which language should be associated with the new dictionary.
ar: باستخدام مربع التركيب هذا، قرر أي لغة يجب أن ترتبط بالقاموس الجديد.
he: תיבה משולבת זו קובעת איזו שפה לשייך למילון החדש.

source: &Language:
ar: &اللُّغة:
he: ש&פה:

source: C&reate new dictionary:
ar: أنشئ &قاموسًا جديدًا:
he: י&צירת מילון חדש:

source: If you select this box a new dictionary is created by either loading a dictionary file or by counting the individual words in a text.
ar: إذا اخترت هذا المربع، يُنشأ قاموس جديد إما عن طريق تحميل ملف قاموس أو عن طريق عد الكلمات الفردية في نص.
he: בחירה בתיבה זו תיצור מילון חדש או על ידי טעינת קובץ מילון או על ידי ספירת כל מילה ומילה בקטע טקסט.

source: &Merge dictionaries
ar: ا&دمج القواميس
he: מי&זוג מילונים

source: If you select this box a new dictionary is created by merging existing dictionaries.
ar: إذا اخترت هذا المربع، يُنشأ قاموس جديد عن طريق دمج القواميس الموجودة.
he: בחירה באפשרות זו תיצור מילון חדש על ידי מיזוג מילונים קיימים.

source: From &file
ar: إنطلاقاً من &الملف
he: מ&קובץ

source: If you select this box a new dictionary is created by loading a file. You may either select an XML file, a standard text file or a file containing a word completion dictionary. If you select a standard text file or an XML file the frequentness of the individual words is detected by simply counting the occurrences of each word.
ar: إذا اخترت هذا المربع، يُنشأ قاموس جديد عن طريق تحميل ملف. يمكنك اختيار إما ملف XML، أو ملف نص عادي، أو ملف يحتوي على قاموس إكمال الكلمات. إذا اخترت ملف نص عادي أو ملف XML، فإن تكرار الكلمات الفردية يُكتشف ببساطة عن طريق عد تكرارات كل كلمة.
he: בחירה בתיבה זו תיצור מילון חדש בטעינת קובץ. אפשר לבחור קובץ XML, קובץ טקסט תקני או קובץ שמכיל מילון להשלמת מילים. אם ייבחר קובץ טקסט תקני או קובץ XML תדירות המילים היחידות תזוהה על ידי ספירת המופעים של כל מילה.

source: From &KDE documentation
ar: من توثيق &كيدي
he: מה&תיעוד של KDE

source: If you select this box a new dictionary is created by parsing the KDE documentation. The frequentness of the individual words is detect by simply counting the occurrences of each word.
ar: إذا اخترت هذا المربع، يُنشأ قاموس جديد عن طريق تحليل توثيق كيدي. يُكتشف تكرار الكلمات الفردية ببساطة عن طريق عد تكرارات كل كلمة.
he: בחירה בתיבה זו תיצור מילון חדש על ידי פענוח תיעוד KDE. תדירות המילים היחידות מזוהה פשוט על ידי ספירת המופעים של כל מילה.

source: From f&older
ar: من &الدليل
he: מ&תיקייה

source: If you select this box a new dictionary is created by loading all files in a folder and its subdirectories.
ar: إذا اخترت هذا المربع، يُنشأ قاموس جديد عن طريق تحميل كل الملفات في دليل ودلائله الفرعية.
he: בחירה בתיבה זו תיצור מילון חדש על ידי טעינת כל הקבצים בתיקייה ובתת־התיקיות שלה.

source: Create an &empty wordlist
ar: أنشئ &قائمة كلمات فارغة
he: יצירת רשימת מילים &ריקה

source: If you select this box a blank dictionary without any entries is created. As KMouth automatically adds newly typed words to the dictionaries it will learn your vocabulary with the time.
ar: إذا اخترت هذا المربع، يُنشأ قاموس فارغ بدون أي مُدْخَلات. بما أن ناطق يضيف آلياً الكلمات المرقونة حديثاً إلى القواميس، فسوف يتعلم مفرداتك مع مرور الوقت.
he: בחירה בתיבה זו תיצור מילון ריק ללא רשומות. תוך כדי הקלדה של מילים חדשות שתתווספנה ל־KMouth למילונים הוא ילמד את אוצר המילים שלך עם הזמן.

source: Source of New Dictionary (1)
ar: مصدر القاموس الجديد (1)
he: מקור למילון חדש (1)

source: Source of New Dictionary (2)
ar: مصدر القاموس الجديد (2)
he: מקור למילון חדש (2)

# In which directory is the file located?
source: &Directory:
ar: ال&دّليل:
he: תי&קייה:

source: With this input field you specify which directory you want to load for creating the new dictionary.
ar: باستخدام حقل الإدخال هذا، حدد أي دليل ترغب بتحميله لإنشاء القاموس الجديد.
he: בשדה קלט זה אפשר לציין אילו תיקיות לטעון ליצירת המילון החדש.

source: Merge result
ar: نتيجة الدمج
he: תוצאות המיזוג
