Repository: KDE/kmouth
Catalog: po/*/kmouth.po
Languages: ar, he

# In the sense of a blank word list
source: Empty list
ar: قائمة خالية
he: רשימה ריקה

source: KDE Documentation
ar: توثيق كِيدِي
he: התיעוד של KDE

# Default dictionary
source: Default
ar: المبدئيّ
he: ברירת מחדל

source: If you select this check box the words from the KDE documentation are spell-checked before they are inserted into the new dictionary.
ar: إذا اخترت هذا المربع، تُفحص الكلمات من توثيق كيدي إملائياً قبل إدراجها في القاموس الجديد.
he: בחירה בתיבת בחירה זו תוביל לבדיקת איות המילים של התיעוד של KDE בטרם הוספתן למילון החדש.

source: With this combo box you select which of the installed languages is used for creating the new dictionary. KMouth will only parse documentation files of this language.
ar: باستخدام مربع التركيب هذا، اختر أي من اللغات المثبتة تُستخدم لإنشاء القاموس الجديد. ناطق سيُحلّل ملفات التوثيق لهذه اللغة فقط.
he: בעזרת תיבת בחירה משולבת זו אפשר לבחור אילו מהשפות המותקנות משמשות ליצירת המילון החדש. KMouth יפענח רק קובצי תיעוד מהשפה הזאת.

source: &Selected Dictionary
ar: ال&قاموس المحدد
he: המילון הנב&חר

source: With this combo box you select the language associated with the selected dictionary.
ar: باستخدام مربع التركيب هذا، اختر اللغة المرتبطة بالقاموس المحدد.
he: בתיבת בחירה משולבת זו אפשר לבחור את השפה המשויכת למילון הנבחר.

source: With this input field you specify the name of the selected dictionary.
ar: باستخدام حقل الإدخال هذا، حدد اسم القاموس المحدد.
he: בשדה קלט זה אפשר לקבוע את שם המילון הנבחר.

source: &Name:
ar: &الإسم:
he: &שם:

source: With this button you can add a new dictionary to the list of available dictionaries.
ar: باستخدام هذا الزر يمكنك إضافة قاموس جديد إلى لائحة القواميس المتاحة.
he: עם הכפתור הזה אפשר להוסיף מילון חדש לרשימת המילונים הזמינים.

source: Add D&ictionary...
ar: أضف قا&موس...
he: הוס&פת מילון…

source: With this button you delete the selected dictionary.
ar: باستخدام هذا الزر يمكنك حذف القاموس المحدد.
he: עם כפתור זה אפשר למחוק את המילון הנבחר.

source: &Delete Dictionary
ar: ا&حذف قاموس
he: מחיקת מ&ילון

source: With this button you move the selected dictionary up.
ar: باستخدام هذا الزر يمكنك نقل القاموس المحدد للأعلى.
he: עם הכפתור הזה אפשר להעלות את המילון הנבחר למעלה.

source: Move &Up
ar: انقل لأ&على
he: הזזה למ&עלה

source: With this button you move the selected dictionary down.
ar: باستخدام هذا الزر يمكنك نقل القاموس المحدد للأسفل.
he: עם הכפתור הזה אפשר להוריד את המילון הנבחר למטה.

source: &Move Down
ar: ا&نقل لأسفل
he: הזזה למ&טה

source: With this button you export the selected dictionary to a file.
ar: باستخدام هذا الزر يمكنك تصدير القاموس المحدد إلى ملف.
he: עם כפתור זה אפשר לייצא את את המילון הנבחר לקובץ.

source: &Export Dictionary...
ar: &صدّر القاموس...
he: יי&צוא מילון…

source: This list contains all available dictionaries for the word completion. KMouth will display a combo box next to the edit field in the main window if this list contains more than one dictionary. You can use this combo box in order to select the dictionary that actually gets used for the word completion.
ar: تحتوي هذه اللائحة على جميع القواميس المتاحة لإكمال الكلمات. ناطق سيعرض مربع تركيب بجانب حقل التحرير في النافذة الرئيسية إذا كانت هذه اللائحة تحتوي على أكثر من قاموس واحد. يمكنك استخدام مربع التركيب هذا لاختيار القاموس الذي يُستخدم فعليًا لإكمال الكلمات.
he: רשימה זו מכילה את כל המילונים להשלמת מילים. KMouth יציג תיבת בחירה משולבת ליד שדה העריכה החלון הראשי אם רשימה זו מכילה יותר ממילון אחד. אפשר להשתמש בתיבת בחירה משולבת זו כדי לבחור את המילון שבו אכן ייעשה שימוש להשלמת מילים.

source: Dictionary
ar: القاموس
he: מילון

source: Language
ar: اللُّغة
he: שפה

source: without name
ar: بلا اسم
he: ללא שם

source: Export Dictionary
ar: صدّر القاموس
he: ייצוא מילון

source: Creating Word List
ar: يُنشئ قائمة كلمات
he: נוצרת רשימת מילים

source: Parsing the KDE documentation...
ar: يُحلّل توثيق كيدي...
he: התיעוד של KDE מפוענח…

source: Merging dictionaries...
ar: يدمج القواميس...
he: מיזוג מילונים…

source: Parsing file...
ar: يُحلّل الملف...
he: קובץ מפוענח…

source: Parsing directory...
ar: يُحلّل الدليل...
he: המילון מפוענח…

source: Performing spell check...
ar: يُجري فحصاً إملائياً...
he: מתבצעת בדיקת איות…
